Repository: GeorgeMC2610/BenzinApp
Catalog: lib/l10n/app_*.arb
Languages: el

# loggedInAs
source: Logged in as: {username}
el: Συνδέθηκες ως: {username}

source: Register to BenzinApp
el: Εγγραφή στο BenzinApp

source: Register
el: Εγγραφή

source: Login to BenzinApp
el: Σύνδεση στο BenzinApp

source: Login
el: Σύνδεση

# usernameHint
source: Enter your username
el: Εισάγετε το username σας

# usernameRegisterHint
source: E.g. 'cool_car_274'
el: Π.χ. 'cool_car_274'

source: Password
el: Κωδικός

# passwordHint
source: Enter your password
el: Εισάγετε τον κωδικό σας

source: Password Confirmation
el: Επιβεβαίωση κωδικού

# passwordConfirmationHint
source: Confirm your password
el: Επιβεβαιώστε τον κωδικό σας

source: Car Manufacturer
el: Μάρκα Αυτοκινήτου

# carManufacturerHint
source: Enter your car's make name
el: Εισάγετε τη μάρκα του αυτοκινήτου σας

source: Car Model
el: Μοντέλο

# carModelHint
source: Enter your car's model
el: Εισάγετε το μοντέλο του αυτοκινήτου σας

source: Car Year
el: Έτος κατασκευής

# carYearHint
source: Enter manufacturing year
el: Εισάγετε το έτος κατασκευής του αυτοκινήτου σας

# welcome
source: Welcome to BenzinApp!
el: Καλωσήρθατε στο BenzinApp!

source: Welcome Back!
el: Καλωσήρθατε!

source: Account Details
el: Στοιχεία Λογαριασμού

source: Car Details
el: Στοιχεία Οχήματος

# dontHaveAnAccount
source: Don't have an account? Press the button
el: Δεν έχετε λογαριασμό; Πατήστε το κουμπί

# forgotPassword
source: Forgot your password? Press the button
el: Ξεχάσατε τον κωδικό σας; Πατήστε το κουμπί

# agreeToTheTandC
source: By making an account to BenzinApp, you agree to the Terms and Conditions. Press the button on the top-right of your screen to read them.
el: Φτιάχνοντας λογαριασμό στο BenzinApp, σημαίνει ότι συμφωνείτε με τους Όρους Χρήσης της εφαρμογής. Πατήστε το κουμπί που βρίσκεται πάνω-δεξιά της οθόνης σας, για να τους διαβάσετε.

source: Home
el: Αρχική

source: Fuel Fills
el: Γεμίσματα

source: Maintenance
el: Συντήρηση

source: Trips
el: Διαδρομές

source: Settings
el: Ρυθμίσεις

source: You planned your fuel fill?
el: Προσχεδιάσατε το γέμισμα; 🤨

source: Last filled today
el: Τελευταίο γέμισμα σήμερα

source: Last filled yesterday
el: Τελευταίο γέμισμα χθες

# lastFilledDaysAgo
source: Last filled {amountOfDays} days ago
el: Τελευταίο γέμισμα πριν από {amountOfDays} ημέρες

source: Last filled at {date}
el: Τελευταίο γέμισμα στις {date}

# insufficientDataTitle
source: Insufficient Data!
el: Ανεπαρκή Δεδομένα!

# insufficientDataText
source: Normally, here you will see a chart that displays your fuel fill records' data over the course of time. You must have at least two fuel fill records added in order for that to display here. Start adding fuel fill records and see the progress of your car's consumption here!
el: Υπό κανονικές συνθήκες, εδώ φαίνεται ένα γράφημα με τα στατιστικά των γεμισμάτων του αυτοκινήτου στο πέρασμα του χρόνου. Θα πρέπει, όμως, να υπάρχουν τουλάχιστον δύο γεμίσματα για να προβληθεί το γράφημα. Ξεκινήστε να βάζετε δεδομένα, για να δείτε την πρόοδο του αυτοκινήτου σας εδώ!

source: FUEL USAGE TREND
el: ΓΡΑΦΗΜΑ ΚΑΤΑΝΑΛΩΣΗΣ

source: COMBINED COSTS
el: ΑΘΡΟΙΣΤΙΚΑ ΚΟΣΤΗ

source: AVERAGE CONSUMPTION
el: ΜΕΣΗ ΚΑΤΑΝΑΛΩΣΗ

source: TOTAL STATISTICS
el: ΣΥΝΟΛΙΚΑ ΣΤΑΤΙΣΤΙΚΑ

source: Liters per 100 km:
el: Λίτρα ανά 100 χλμ.:

source: Kilometers per Liter:
el: Χιλιόμετρα ανά Λίτρο:

source: Cost per Kilometer:
el: Κόστος ανά Χιλιόμετρο:

source: Total Liters Filled:
el: Συνολικά Γεμισμένα Λίτρα:

source: Total Kilometers Travelled:
el: Συνολικά Χιλιόμετρα:

source: Total Costs:
el: Συνολικά Κόστη:

source: No Fuel Fill Records.
el: Δεν υπάρχουν Γεμίσματα.

source: No Malfunctions.
el: Δεν υπάρχουν Βλάβες.

source: No Services.
el: Δεν υπάρχουν Σέρβις.

source: No Trips.
el: Δεν υπάρχουν Διαδρομές.

source: Repeating Trips
el: Επαναλαμβανόμενες

source: One-Time Trips
el: Ταξίδια

source: Application Appearance
el: Εμφάνιση Εφαρμογής

source: Dark Mode
el: Σκούρο Φόντο

source: Language
el: Γλώσσα

source: Account Settings
el: Ρυθμίσεις Λογαριασμού

source: Fast Login
el: Γρήγορη Επανασύνδεση

source: Edit Account
el: Επεξεργασία Προφίλ

source: Logout
el: Αποσύνδεση

source: About the App
el: Σχετικά με την Εφαρμογή

source: Privacy Policy
el: Πολιτική Απορρίτου

source: Terms and Conditions
el: Όροι Χρήσης

source: App Information
el: Πληροφορίες Εφαρμογής

source: Edit
el: Επεξεργασία

source: Delete
el: Διαγραφή

source: Malfunctions
el: Βλάβες

source: Services
el: Σέρβις

source: Filters
el: Φίλτρα

source: Search in fuel fills...
el: Αναζήτηση γεμισμάτων...

# totalRecords
source: {totalRecords} Total Records
el: {totalRecords} Συνολικά Γεμίσματα

# oneRecord
source: Only one record. Singular and lonely...
el: Μόνο ένα γέμισμα. Μόνο του... μοναχικό...

source: Confirm Delete Fuel Fill
el: Διαγραφή Γεμίσματος

source: Confirm Delete Service
el: Διαγραφή Σέρβις

source: Confirm Delete Malfunction
el: Διαγραφή Βλάβης

# confirmDeleteTrips
source: Confirm Delete Trip
el: Διαγραφή Διαδρομής

# confirmDeleteGenericBody
source: Are you sure? This action cannot be undone.
el: Η διαγραφή είναι μόνιμη. Είστε σίγουρος;

source: Cancel
el: Ακύρωση

source: Fuel Fill Record Data
el: Στοιχεία Γεμίσματος

source: Unspecified
el: Άγνωστο

source: Liters:
el: Λίτρα:

source: Kilometers:
el: Χιλιόμετρα:

source: Cost:
el: Κόστος:

source: Consumption:
el: Κατανάλωση:

source: Efficiency:
el: Αποδοτικότητα:

source: Travel Cost:
el: Κόστος Μετακίνησης:

source: Comments:
el: Παρατηρήσεις:

source: Nothing to show here.
el: Δεν υπάρχουν δεδομένα.

source: Edit Fuel Fill Record
el: Επεξεργασία Γεμίσματος

source: Add Fuel Fill Record
el: Προσθήκη Γεμίσματος

source: Required Info
el: Υποχρεωτικά Πεδία

source: Mileage
el: Χιλιόμετρα

source: Total Mileage
el: Συνολικά Χιλιόμετρα

# cost2
source: Cost
el: Κόστος

# liters2
source: Liters
el: Λίτρα

source: Select a date...
el: Επιλέξτε ημερομηνία...

source: Pick a date
el: Επιλογή

# todayDate
source: Today's date
el: Επιλογή «σήμερα»

source: Optional Info
el: Προαιρετικά Πεδία

source: Fuel Type
el: Τύπος Καυσίμου

# station
source: Station Name
el: Πρατήριο

# comments2
source: Comments
el: Σχόλια

source: Confirm Add
el: Προσθήκη

# confirmEdit
source: Confirm Changes
el: Επιβεβαίωση Αλλαγών

# inKmHint
source: in km...
el: σε χλμ...

# costHint
source: cost
el: κόστος

# litersHint
source: lt
el: λίτρα

# fuelTypeHint
source: E.g. "FuelSave 95"
el: Π.χ. «FuelSave 95»

# stationHint
source: E.g. "Shell" or "bp"
el: Π.χ. «Shell» or «bp»

# commentsHint
source: Anything useful about this fuel fill...
el: Οτιδήποτε χρήσιμο σχετικά με αυτό το γέμισμα...

# noDateSelected
source: You haven't selected a date yet.
el: Δεν έχετε επιλέξει ημερομηνία.

source: Cannot be empty
el: Δεν μπορεί να είναι κενό

source: Cannot be negative
el: Μόνο θετικοί αριθμοί

source: Discovered at:
el: Διαπιστώθηκε στα:

# ongoingMalfunction
source: Ongoing
el: Σε εξέλιξη

# fixedMalfunction
source: Fixed
el: Επισκευασμένη

# nextAtKm
source: Next at:
el: Επόμενο:

source: Malfunction data
el: Στοιχεία Βλάβης

source: Date discovered:
el: Ημερομηνία καταγραφής:

source: Kilometers discovered:
el: Χιλιόμετρα που ανακαλύφθηκε:

source: Malfunction Severity
el: Σφοδρότητα Βλάβης

# severityLowest
source: Lowest
el: Ασήμαντη

# severityLow
source: Low
el: Λίγο Σημαντική

# severityNormal
source: Normal
el: Κανονική

# severityHigh
source: High
el: Πολύ Σημαντική

# severityHighest
source: Highest
el: Μέγιστης Σημασίας

# malfunctionEnded
source: Select end date...
el: Ημερομηνία επισκευής...

source: Status:
el: Κατάσταση:

source: Title:
el: Τίτλος:

source: Description:
el: Περιγραφή:

source: Date fixed:
el: Ημερομηνία επισκευής:

# locationFixed
source: Location:
el: Τοποθεσία επισκευής:

source: Service Data
el: Στοιχεία Σέρβις

source: Date done:
el: Ημερομηνία:

source: Service mileage:
el: Χιλιόμετρα:

source: Next service at:
el: Χιλιόμετρα επόμενου:

source: Location:
el: Τοποθεσία:

source: See on map
el: Προβολή

source: Maintenance Category
el: Κατηγορία Συντήρησης

source: Select maintenance type:
el: Επιλογή κατηγορίας:

source: Malfunction
el: Βλάβη

source: Service
el: Σέρβις

source: Coming Soon...
el: Μη διαθέσιμο...

source: Add Service
el: Προσθήκη Σέρβις

source: Edit Service
el: Επεξεργασία Σέρβις

source: Service Info
el: Πληροφορίες Σέρβις

# description2
source: Description
el: Περιγραφή

# serviceMileage2
source: Service Mileage
el: Χιλιόμετρα

source: Next Service Mileage
el: Χιλιόμετρα επόμενου

# descriptionHint
source: What happened in this service?
el: Περιγράψτε τι έγινε σε αυτό το σέρβις...

# serviceMileageHint
source: Enter service mileage...
el: Εισάγετε χιλιόμετρα...

source: Next Service Info
el: Πληροφορίες Επόμενου

# nextServiceMileageHint
source: Enter next service mileage...
el: Εισάγετε τα χιλιόμετρα του επόμενου...

source: Confirm Add Service
el: Επιβεβαίωση Προσθήκης Σέρβις

source: Add Malfunction
el: Προσθήκη Βλάβης

source: Edit Malfunction
el: Επεξεργασία Βλάβης

source: Malfunction Info
el: Στοιχεία Βλάβης

# malfunctionTitle
source: Title
el: Τίτλος

# malfunctionTitleHint
source: What's malfunctioning...?
el: Τι πήγε στραβά...;

# descriptionHintMalfunction
source: Describe what is malfunctioning...
el: Περιγράψτε τι έχει χαλάσει...

source: Please select an end date.
el: Παρακαλώ προσδιορίστε πότε επισκευάστηκε η βλάβη.

source: I fixed this malfunction
el: Επισκευάστηκε η βλάβη

source: Repair Data
el: Στοιχεία Επισκευής

source: Repair Cost
el: Κόστος Επισκευών

# repairCostHint
source: Enter cost...
el: Εισάγετε το κόστος...

# uncheckingTheBox
source: Warning! By unchecking the box, you will mark this functions as ongoing.
el: Προσοχή! Ξε-μαρκάροντας το κουτί, θα προσδιορίσετε την βλάβη ως «μη επισκευασμένη»

source: Select Location...
el: Επιλογή τοποθεσίας...

source: Trip Data
el: Στοιχεία Διαδρομής

# tripName
source: Title:
el: Φιλική Ονομασία:

source: Weekly Occurrence:
el: Εβδομαδιαία Επανάληψη:

source: Trip Distance:
el: Απόσταση Διαδρομής:

source: Analytics Per Time
el: Στατιστικά Ανά Φορά

source: per time
el: ανά φορά

source: Weekly Analytics
el: Στατιστικά Ανά Εβδομάδα

source: per week
el: ανά εβδομάδα

source: Map Details
el: Στοιχεία Χάρτη

source: Show on maps
el: Προβολή στον χάρτη

# repeatingTimesPerWeek
source: Repeating {n} times per week
el: Επαναλαμβάνεται {n} φορές εβδομαδιαία

# repeatingTimesPerWeekShort
source: {n} times per week
el: {n} φορές την εβδομάδα

source: One-time trip
el: Ταξίδι

# noRepeat
source: Doesn't Repeat
el: Δεν επαναλαμβάνεται

# createdAt
source: Created at: {date}
el: Δημιουργήθηκε: {date}

# viewLocation
source: View Location On Maps
el: Προβολή Τοποθεσίας

# viewTrip
source: View Tip On Maps
el: Προβολή Διαδρομής

source: Origin
el: Αφετηρία

source: Destination
el: Τέρμα

source: Add Trip
el: Προσθήκη Διαδρομής

source: Edit Trip
el: Επεξεργασία Διαδρομής

source: Trip Info
el: Πληροφορίες Διαδρομής

# tripName2
source: Trip's Title
el: Φιλική Ονομασία

# tripNameHint
source: E.g.: "Trip to Florida" or "Home to Work"...
el: Π.χ.: "Ταξίδι στην Λαμία" ή "Σπίτι-Δουλειά"...

# timesRepeating
source: Occurrence
el: Επανάληψη

# timesRepeatingHint
source: Per Week
el: Εβδομαδιαία

source: Make Trip...
el: Δημιουργήστε Διαδρομή...

source: Make on Maps
el: Δημιουργία

# pickAPlace
source: Pick on Maps
el: Επιλογή

source: Remove location
el: Διαγραφή

source: Delete Trip
el: Διαγραφή

# createTrip
source: Create Trip on Maps
el: Δημιουργία Διαδρομής

# pickLocationOnMap
source: Pick Location on Maps
el: Επιλογή Τοποθεσίας

# typeAnAddress
source: Type an address, or long-press on the map.
el: Βάλτε μία διεύθυνση, ή πατήστε παρατεταμένα τον χάρτη.

source: Search Address
el: Αναζήτηση Διεύθυνσης

# searchAddressHintOrigin
source: Type an address for the origin...
el: Γράψτε την διεύθυνση της αφετηρίας...

# searchAddressHintDestination
source: Type an address for the destination...
el: Γράψτε την διεύθυνση του τέρματος...

# searchAddressHintLocation
source: Type an address for the location...
el: Γράψτε την διεύθυνση της τοποθεσίας...

source: FROM
el: ΑΠΟ

source: TO
el: ΠΡΟΣ

source: Please make a trip.
el: Παρακαλώ φτιάξτε μία διαδρομή.

source: No places found with this address.
el: Δεν βρέθηκε κάποιο μέρος με αυτήν τη διεύθυνση.

# noTripsFound
source: There is no route available for the current positions.
el: Δεν υπάρχει κάποια διαδρομή με αυτές τις τοποθεσίες.

source: Confirm Trip
el: Επιβεβαίωση Διαδρομής

source: Confirm Location
el: Επιβεβαίωση Τοποθεσίας
